/* 6. Структура CandyBar включает три члена, как описано в предыдущем упражнении. 
Напишите программу, которая создает массив из трех структур CandyBar, инициализирует их значениями по вашему усмотрению и затем отображает содержимое каждой структуры. */
#include <iostream>
int main(void)
{
    using namespace std;
    string snak[] = { "Illya", "Illya", "Skvortsov"};
    cout << snak[0] << endl;
    cout << snak[2] << endl;
    cout << snak[1] << endl;
    return 0;
}