/* Королевство Нейтрония, где денежной единицей служит тварп, использует следующую шкалу налогообложения: 
первые 5 000 тварпов — налог 0% 
следующие 10 000 тварпов — налог 10% 
следующие 20 000 тварпов — налог 15% 
свыше 35 000 тварпов — налог 20% 
Например, если некто зарабатывает 38 000 тварпов, то он должен заплатить налогов 5000 х 0,00 + 10000 х 0,10 + 20000 х 0,15 + 3000 х 0,20, или 4 600 тварпов. 
Напишите программу, которая использует цикл для запроса доходов и выдачи подлежащего к выплате налога. Цикл должен завершаться, когда пользователь вводит отрицательное или нечисловое значение. 
*/
#include <iostream>
int main(void)
{
    using namespace std;
    int tvarp, sum;
    cin >> tvarp;
    if(tvarp > 35000)
    {
        tvarp -= 35000;
        sum += tvarp * 0.20;
        tvarp = 35000;
    }
    if(tvarp > 15000)
    {
        tvarp -= 15000;
        sum += tvarp * 0.15;
        tvarp = 15000;
    }
    if(tvarp > 5000)
    {
        tvarp -= 5000;
        sum += tvarp * 0.10;
        tvarp = 5000;
    }
    cout << sum;
    return 0;
}