// 1. Напишите программу на C++, которая отобразит ваше имя и адрес (можете указать фиктивные данные). 
#include <iostream>
int main(void)
{
    using namespace std;
    cout << "Illya Skvortsov\n";
    cout << "Yana Chechota 36, 202" << endl;
    return 0;
}