//4. Напишите программу, выводящую на экран ваше любимое стихотворение. 
//Для разбиения на строчки используйте подходящую управляющую последовательность.
#include <iostream>
using namespace std;
int main()
{
    cout << "When you're not around\nI can't do anything\n";
    cout << "I long for the taste of your cooking\n";
    cout << "So  when you get back home\n";
    cout << "I'm gonna glomp you with a great big smile\n";
    cout << "arittake no Arigatou\n" << "uta ni nosete todoketai\n" << "kono kimochi wa zutto zutto wasurenai yo\n";
    cout << "omoi yo todoke\n";
    return 0;
}